{
  "entities": [
    [
      [
        33,
        47
      ],
      [
        131,
        145
      ],
      [
        9864,
        9878
      ]
    ],
    [
      [
        179,
        195
      ],
      [
        1922,
        1940
      ],
      [
        2114,
        2132
      ],
      [
        2492,
        2510
      ],
      [
        3366,
        3384
      ],
      [
        3831,
        3849
      ],
      [
        4288,
        4306
      ],
      [
        5150,
        5168
      ],
      [
        5490,
        5508
      ],
      [
        5716,
        5734
      ],
      [
        5871,
        5889
      ],
      [
        6051,
        6069
      ],
      [
        6705,
        6723
      ],
      [
        7435,
        7453
      ],
      [
        8756,
        8774
      ],
      [
        9831,
        9847
      ],
      [
        9847,
        9864
      ],
      [
        9926,
        9942
      ]
    ],
    [
      [
        254,
        264
      ],
      [
        652,
        662
      ],
      [
        748,
        758
      ],
      [
        1835,
        1844
      ]
    ],
    [
      [
        358,
        373
      ],
      [
        1300,
        1315
      ],
      [
        9725,
        9740
      ]
    ],
    [
      [
        872,
        878
      ],
      [
        912,
        924
      ],
      [
        1912,
        1919
      ],
      [
        2059,
        2065
      ],
      [
        3767,
        3773
      ],
      [
        4149,
        4155
      ],
      [
        4169,
        4171
      ],
      [
        4344,
        4350
      ],
      [
        5096,
        5102
      ],
      [
        6624,
        6630
      ],
      [
        6649,
        6655
      ],
      [
        6894,
        6900
      ],
      [
        7318,
        7324
      ],
      [
        7376,
        7379
      ],
      [
        9884,
        9890
      ]
    ],
    [
      [
        940,
        942
      ],
      [
        4413,
        4416
      ],
      [
        9185,
        9188
      ]
    ],
    [
      [
        1069,
        1091
      ],
      [
        1683,
        1705
      ],
      [
        2264,
        2268
      ],
      [
        2900,
        2904
      ],
      [
        2929,
        2933
      ],
      [
        2948,
        2952
      ],
      [
        3402,
        3425
      ]
    ],
    [
      [
        1075,
        1091
      ],
      [
        1461,
        1477
      ],
      [
        1689,
        1705
      ],
      [
        3409,
        3425
      ],
      [
        5566,
        5583
      ],
      [
        6539,
        6555
      ]
    ],
    [
      [
        1239,
        1245
      ],
      [
        1248,
        1254
      ],
      [
        1257,
        1263
      ],
      [
        1497,
        1500
      ],
      [
        1559,
        1565
      ],
      [
        1675,
        1705
      ],
      [
        1756,
        1762
      ],
      [
        1854,
        1860
      ],
      [
        2253,
        2259
      ],
      [
        2752,
        2758
      ],
      [
        5591,
        5597
      ],
      [
        6832,
        6838
      ],
      [
        7600,
        7606
      ],
      [
        8728,
        8734
      ],
      [
        9225,
        9231
      ],
      [
        9595,
        9601
      ]
    ],
    [
      [
        1612,
        1630
      ],
      [
        2821,
        2840
      ]
    ],
    [
      [
        1711,
        1723
      ],
      [
        1731,
        1734
      ]
    ],
    [
      [
        1735,
        1736
      ],
      [
        2410,
        2411
      ],
      [
        2476,
        2481
      ],
      [
        3183,
        3186
      ],
      [
        6135,
        6136
      ],
      [
        8167,
        8171
      ],
      [
        8788,
        8792
      ],
      [
        8806,
        8807
      ],
      [
        9243,
        9244
      ],
      [
        9305,
        9307
      ]
    ],
    [
      [
        1888,
        1898
      ],
      [
        1989,
        1999
      ],
      [
        2668,
        2678
      ],
      [
        2739,
        2748
      ],
      [
        3356,
        3365
      ],
      [
        4277,
        4287
      ],
      [
        4363,
        4373
      ],
      [
        4378,
        4381
      ],
      [
        4490,
        4500
      ],
      [
        4524,
        4534
      ]
    ],
    [
      [
        2000,
        2007
      ],
      [
        2679,
        2686
      ],
      [
        4396,
        4403
      ]
    ],
    [
      [
        2079,
        2086
      ],
      [
        2598,
        2605
      ],
      [
        5936,
        5942
      ],
      [
        6085,
        6092
      ],
      [
        6767,
        6773
      ],
      [
        9473,
        9479
      ]
    ],
    [
      [
        2187,
        2190
      ],
      [
        4427,
        4430
      ],
      [
        9133,
        9137
      ],
      [
        9588,
        9591
      ]
    ],
    [
      [
        2207,
        2208
      ],
      [
        2269,
        2270
      ],
      [
        2291,
        2292
      ],
      [
        2436,
        2437
      ],
      [
        2549,
        2550
      ],
      [
        5587,
        5588
      ],
      [
        7596,
        7597
      ]
    ],
    [
      [
        2559,
        2605
      ],
      [
        2629,
        2644
      ]
    ],
    [
      [
        2700,
        2708
      ],
      [
        4109,
        4117
      ],
      [
        4174,
        4182
      ]
    ],
    [
      [
        2711,
        2714
      ],
      [
        2905,
        2908
      ]
    ],
    [
      [
        2716,
        2718
      ],
      [
        2934,
        2936
      ]
    ],
    [
      [
        2844,
        2849
      ],
      [
        8785,
        8787
      ]
    ],
    [
      [
        2939,
        2945
      ],
      [
        2953,
        2959
      ],
      [
        3060,
        3071
      ],
      [
        3213,
        3219
      ]
    ],
    [
      [
        3437,
        3467
      ],
      [
        3490,
        3493
      ]
    ],
    [
      [
        3611,
        3617
      ],
      [
        3645,
        3651
      ],
      [
        3661,
        3666
      ],
      [
        3987,
        3993
      ],
      [
        4025,
        4031
      ],
      [
        4250,
        4258
      ],
      [
        4711,
        4717
      ],
      [
        5286,
        5292
      ],
      [
        5444,
        5461
      ],
      [
        5632,
        5638
      ],
      [
        6736,
        6742
      ]
    ],
    [
      [
        3880,
        3905
      ],
      [
        3909,
        3917
      ]
    ],
    [
      [
        4501,
        4504
      ]
    ],
    [
      [
        4535,
        4540
      ],
      [
        4546,
        4549
      ],
      [
        4604,
        4609
      ]
    ],
    [
      [
        4693,
        4710
      ],
      [
        6368,
        6385
      ]
    ],
    [
      [
        4778,
        4803
      ],
      [
        4822,
        4825
      ],
      [
        4827,
        4913
      ],
      [
        4915,
        4936
      ],
      [
        5259,
        5276
      ]
    ],
    [
      [
        4873,
        4882
      ],
      [
        5744,
        5753
      ],
      [
        6309,
        6318
      ],
      [
        6462,
        6470
      ]
    ],
    [
      [
        4980,
        4989
      ],
      [
        4991,
        4998
      ]
    ],
    [
      [
        5659,
        5680
      ],
      [
        5704,
        5715
      ],
      [
        5786,
        5797
      ]
    ],
    [
      [
        5823,
        5830
      ],
      [
        5835,
        5842
      ]
    ],
    [
      [
        5980,
        6013
      ],
      [
        6015,
        6022
      ]
    ],
    [
      [
        6122,
        6124
      ],
      [
        6165,
        6167
      ]
    ],
    [
      [
        6197,
        6205
      ],
      [
        6247,
        6255
      ],
      [
        6258,
        6266
      ],
      [
        6481,
        6489
      ],
      [
        6502,
        6510
      ],
      [
        6673,
        6681
      ],
      [
        7133,
        7141
      ]
    ],
    [
      [
        6207,
        6214
      ],
      [
        7036,
        7043
      ],
      [
        7046,
        7053
      ],
      [
        7401,
        7408
      ],
      [
        7539,
        7546
      ]
    ],
    [
      [
        6216,
        6226
      ],
      [
        7650,
        7660
      ],
      [
        7674,
        7684
      ],
      [
        7891,
        7901
      ],
      [
        8701,
        8711
      ]
    ],
    [
      [
        6228,
        6236
      ],
      [
        7663,
        7671
      ],
      [
        7687,
        7695
      ],
      [
        7821,
        7829
      ]
    ],
    [
      [
        6239,
        6244
      ],
      [
        8777,
        8782
      ],
      [
        8827,
        8832
      ],
      [
        8902,
        8907
      ]
    ],
    [
      [
        6279,
        6305
      ],
      [
        6320,
        6327
      ]
    ],
    [
      [
        6666,
        6669
      ],
      [
        9049,
        9052
      ]
    ],
    [
      [
        6792,
        6801
      ],
      [
        7465,
        7474
      ]
    ],
    [
      [
        7079,
        7125
      ],
      [
        7143,
        7160
      ]
    ],
    [
      [
        7832,
        7855
      ],
      [
        7857,
        7864
      ]
    ],
    [
      [
        8140,
        8147
      ],
      [
        8691,
        8698
      ]
    ],
    [
      [
        9450,
        9489
      ],
      [
        9568,
        9574
      ],
      [
        9677,
        9689
      ]
    ],
    [
      [
        9625,
        9632
      ],
      [
        9635,
        9637
      ]
    ]
  ],
  "includes": [
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    []
  ],
  "text": "\n\nОбзор современных инструментов дата-аналитика / Habr\n\n\n              16  February  2021 at 18:16  Обзор современных инструментов дата-аналитика Data Mining *Data visualization *Machine learning *Artificial Intelligence       \n\n\nСразу уточню, что видов аналитиков очень много, так как анализировать можно все что угодно. Это и веб-аналитики, и классические data scientists, и бизнес-аналитики, и финансовые аналитики, а также продуктовые, системные и UX аналитики. Причина такого разнообразия, по-видимому, в том, что в ряде крупных компаний над созданием одной платформы или продукта одновременно могут работать десятки, а то и сотни программистов и аналитиков. В таких условиях происходит сильное сужение специализации.\n\n\nВсе перечисленные виды аналитиков используют свои специфические наборы инструментов. Поэтому сосредоточусь только непосредственно на сфере анализа данных вне контекста происхождения этих самых данных. Таким образом мы исключаем из обзора системы веб-аналитики, CRM, ERP, системы складского учета, управления логистикой и документооборотом.\n\n1. Языки программирования\n\nНе будем касаться исключительных, уникальных или редких случаев. Рассмотрим все только самое популярное. И конечно же, в первую очередь, это язык python.\n\nPython\n\n\nPython служит главным инструментом в руках data scientists, не имеет строгой типизации и предназначен для быстрой разработки прототипов или написания коротких сценариев или скриптов. Люди разбирающиеся в программировании и computer science его часто критикуют за то, что алгоритмы написанные на чистом python оказываются не оптимальными в отношении своей производительности и требованиям к памяти.\n\n\nНо тем не менее у данного языка программирования есть много плюсов. Среди них я бы отметил то, что python преподают уже практически везде, в связи с чем сравнительно легко найти аналитика знающего python. Второе преимущество — это библиотеки для работы с данными и машинного обучения, имеющие удобный интерфейс. Например, на основе библиотеки sklearn легко собирать конвейеры предварительной обработки данных и построения моделей. Все алгоритмы и настройки машинного обучения инкапсулированы внутри классов и объектов, что делает код очень простым.\n\nR\n\n\nДо недавнего времени основным конкурентом python был язык R. Пожелания к знанию R и сейчас изредка встречаются в описаниях вакансий по крайней мере в разделе «преимущества». До середины 2018-го года я и сам программировал на R. И при попытке автоматизировать часть своей работы по машинному обучению чуть не изобрел велосипед, пытаясь на R создать конвейеры подготовки данных и обучения моделей. Чуть позже узнал, что такие конвейеры уже давно существуют в библиотеке sklearn и называются pipeline.\n\nC++, C#\n\n\nЕсли существующих библиотек на python недостаточно и требуется реализовать новый алгоритм с высокой производительностью, к вашим услугам компилируемый и статически типизированный язык C++ или похожий на него язык C#.\n\nMatLab\n\n\nЯзык MatLab встроен в одноименный пакет программ и интерактивную среду инженерных расчетов. Правда предназначен данный язык в большей степени для решения технических задач, а не для выполнения финансового или бизнес-анализа. Например, мне посчастливилось применять MatLab дважды: в процессе исследования сигналов акустической эмиссии в конструкциях, а также при обработке человеческой речи.\n\n\nСуществует ряд библиотек машинного обучения с API для других языков программирования, таких как Java, JavaScript, Scala и т.д. Но останавливаться на них не буду поскольку цель статьи немного иная.\n\n\nПрошу немного потерпеть. Обо всем вы узнаете в следующих разделах.\n\n2. AutoML и визуальные конструкторы\n\nAutoML согласно своей основной идее резко упрощает задачу исследователя и сводит несколько шагов по изучению и подготовке данных, конструированию признаков, выбору и сравнению алгоритма машинного обучения и настройке гиперпараметров к одному единственному шагу. И этот шаг заключается в выборе и настройке одного большого ящика под названием AutoML. Результатом запуска алгоритма AutoML является сконструированный и соответствующим образом настроенный и обученный pipeline. Остается только брать «сырые» данные, подсовывать их в pipeline и ждать на выходе результат в виде прогнозов.\n\n\nЯщик под названием «AutoML» выглядит либо как библиотека машинного обучения, либо как веб-сервис куда заливаются данные.\n\n\nЕсли это библиотека, то она отличается от sklearn тем, что наш привычный код в 20-30 строк сжимается до 5 строк. Известный пример такой библиотеки H2O.\n\n\nДругой пример — библиотека MLBox. Про нее в интернете можно найти истории, о том как применение MLBox позволило попасть в топовые 5% на соревнованиях kaggle.\n\n\nТеперь несколько слов об облачных сервисах AutoML. Во первых, свои технические решения спешат представить все основные цифровые гиганты. Вот некоторые из них: Google AutoML Tables, Azure Machine Learning (Microsoft), SageMaker Autopilot (Amazon). Перечисленные сервисы должны быть интересны в первую очередь тем компаниям, которые разрабатывают аналитические системы на облачных платформах. Очень удобно, когда и инфраструктуру данных, и вычислительные ресурсы, и готовые алгоритмы машинного обучения предоставляет один и тот же провайдер. Интеграция получается поистине бесшовной.\n\n\nПомимо цифровых гигантов на рынке AutoML появляются и игроки поменьше. Например, непосредственно в настоящий момент в компании Bell Integrator идет активная работа над платформой neuton.ai.\n\n\nВ этом же разделе стоит вспомнить про системы машинного обучения, занимающие промежуточные позиции между непосредственным программированием на R и Python и полностью упакованным в коробку AutoML. Это так называемые конструкторы workflow. Два типичных примера: конструктор машинного обучения Azure от Microsoft и платформа SberDS Сбербанка.\n\n\nКонструктор представляет собой набор кубиков, из которых можно собрать весь конвейер машинного обучения, включая финальную проверку работоспособности модели. Это несомненно красивое решение для людей с визуальным типом мышления, которым удобно представлять процесс машинного обучения и тестирования моделей в виде схем.\n\n3. Инструменты BI\n\nЗдесь бы я хотел рассмотреть несколько BI решений в области аналитики: Power BI, Tableau, Qlik Sense, QlikView и Excel.\n\nPower BI\n\n\nPower BI — это набор аналитических инструментов от Microsoft, которые доступны в виде десктопных приложений и облачных сервисов. Существуют корпоративные решения, работающие на закрытой it-инфраструктуре компании. Работа в Power BI Desktop или Power BI Services не требует навыков программирования. Предусмотрена возможность онлайн-интеграции с внешними источниками данных, а также загрузка данных в формате csv.\n\n\nPower BI способен решать задачи машинного обучения посредством AutoML, то есть для построения модели классификации или регрессии писать программный код как на питоне не придется. Кроме стандартных задач анализа табличных данных в функционал встроены технологии анализа тональности, извлечения ключевых фраз, распознавания языка и добавления тегов к изображению.\n\nTableau\n\n\nTableau также представляет собой целое семейство онлайн и десктопных приложений, как и Power BI. Данные приложения имеют простой визуальный интерфейс и позволяют работать методом перетаскивания drag-and-drop. Красивые графики строятся буквально за несколько кликов. Также данные можно анализировать в табличном виде и применять к ним различные фильтры.\n\n\nTableau позволяет решать и задачи машинного обучения, такие как регрессия, прогнозирование временных рядов, кластерный анализ. А главное, Tableau способен интегрироваться с внешними скриптами на R и Python. Получается легко расширяемый инструмент.\n\nQlik Sence и QlikView\n\n\nQlik Sence и QlikView по позиционированию и интерфейсу отличаются между собой, но по сути и по алгоритмам решения задач построены на одном движке. QlikView — корпоративная платформа, которой управляют it-специалисты, Qlik Sence — инструмент для личного использования без необходимости обращаться за помощью в тех. поддержку.\n\n\nПри первом же знакомстве бросается в глаза «красота» и легкость визуализации. Это тот самый инструмент, если надо построить приятный глазу дашборд для руководства. С моей точки зрения особенно зрелищным выглядит возможность менять масштаб при анализе географических карт и кластеров на двухмерных графиках. Вспоминаются кадры из фильмов, где на фото со спутников пытаются разглядеть номер автомобиля или выделить человека из толпы на площади.\n\n\nЕще одна интересная опция — наличие мобильного приложения для выполнения анализа со смартфона. Так и представляется топ-менеджер сети ритейла, спешащий на очередной рейс в аэропорту и получивший неожиданное сообщение в мессенджере со ссылкой на дашборд.\n\nQlik Sence интегрируется с Python, а следовательно и с машинным обучением.\n\nExcel\n\n\nВы меня простите, но я не мог пройти мимо Excel. Сколько не смейся, но любой инструмент по своему хорош. Например, в Excel прекрасно строятся сводные таблицы и графики, буквально в несколько кликов. В сочетании с удобным табличным процессором и работой с форматом csv вполне себе хороший инструмент.\n\n4. Изюминка на торте. Автоматическая генерация кода на основе AI\n\nКак-то раз при знакомстве в сети мне задали вопрос «ты программируешь на python?». И когда я ответил «Да», продолжение было совершенно неожиданным.\n\n\n«А ты знаешь про это… » и далее шла ссылка на ролик в Youtube \nhttps://www.youtube.com/watch?v=fZSFNUT6iY8&t=4s&ab_channel=FazilBabu.\n\n\nРечь идет о генеративной текстовой модели от OpenAI, обученной на репозитории GitHub. На конкретных примерах показана способность модели генерировать код на Python на основании заголовка функции и ее краткого описания.\n\n\nА что будет, если такую модель удастся хорошо обучить на скриптах data scientists? Это вопрос для размышлений…    Tags: аналитикdata sciencebusiness intelligencedata miningmachine learningмашинное обучениедата-аналитиканализ данных Hubs: Data MiningData visualizationMachine learningArtificial Intelligence          \n\n\n"
}